<!doctype html>
<html lang="en">
  <head>
    <!-- Required meta tags -->
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <!-- Bootstrap CSS -->
    <link href="https://cdn.jsdelivr.net/npm/bootstrap@5.1.3/dist/css/bootstrap.min.css
" rel="stylesheet" integrity="sha384-1BmE4kWBq78iYhFldvKuhfTAU6auU8tT94WrHftjDbrCEXSU1oBoqyl2QvZ6jIW3" crossorigin="anonymous">
    <title>chiangmai province website</title>
    <link
      rel="stylesheet"
      href="https://fonts.googleapis.com/css?family=Sarabun
"
    />
    <style>
      body {
        font-family : "sarabun";
        background-color : #CCFFFF ;
      }
      #header{
        height: 160px;
        padding: 50px;
        background-image: url("p.jpg");
        background-size:100%;
      }
      #sidebar{
        background-color: #f1f1f1;
        padding: 0px;
      }
      #content{
        padding: 10px;
        background-color: gray;
      }
      #footer{
        padding: 30px;
        height: 200px;
        background-color: pink;
      }
      
      ul {
        list-style-type: none;
        margin: 0;
        padding: 0;
        width: 100%;
        background-color: #f1f1f1;
      }
      li a {
        display: block;
        color: #000;
        padding: 8px 16px;
                text-decoration: none;
      }
      /* Change the link color on hover */
      li a:hover {
        background-color: #555;
        color: white;
      }
      p{
        margin-top: 10px;
      }
    </style>
    
  </head>
  <body> 
    <div class="container"> 
      <div class="row">
        <div class="col-12" id="header">
          <center><h1>จังหวัดเชียงใหม่</h1></center>
        </div>
      </div>
      <div class="row">
        <div class="col-3" id="sidebar"> 
          <ul>
            <li><a href="lswproject.php">หน้าแรก</a></li>
            <li><a href="location.php">แหล่งท่องเที่ยว</a></li>
            <li><a href="custom.php">ประเพณีและวัฒนธรรม</a></li>
            <li><a href="food.php">อาหารประจำท้องถิ่น</a></li>
            <li><a href="owner.php">ข้อมูลผู้จัดทำ</a></li>
          </ul>
        </div>
        <div class="col-9" id="content"> 
          <h4>แหล่งท่องเที่ยว</h4>
        <br><b>1.พระบรมธาตุดอยสุเทพ</b>  
          <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;เป็นปูชนียสถานที่สำคัญยิ่งของเมืองเชียงใหม่ ประดิษฐานอยู่บนดอยสุเทพ สูงจากระดับน้ำทะเล 1,000 เมตร พระบรมธาตุดอยสุเทพ ตั้งอยู่ทางด้านทิศตะวันตกของตัวเมือง ห่างจากตัวเมืองเก่าประมาณ 10 กิโลเมตร สามารถมองเห็นจากตัวเมืองได้ชัดเจน ที่เที่ยวเชียงใหม่ ภายในยังได้ประดิษฐานพระบรมสารีริกธาตุองค์ใหญ่ ที่พญากือนา กษัตริย์องค์ที่ 6 แห่งอาณาจักรล้านนา ราชวงศ์มังราย ได้ทรงเก็บไว้สักการบูชาส่วนพระองค์ถึง 13 ปี มาบรรจุไว้ที่นี่ให้ประชาชนได้เดินทางมาสักการะบูชาเพื่อความเป็นสิริมงคล
        <br><br><img src="1.jpeg" width = "900px" class="img-fluid rounded">
          <br><br><b>2.วัดเจดีย์หลวงวรวิหาร</b>
          <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ตั้งอยู่ใจกลางเมืองเชียงใหม่ ที่เที่ยวเชียงใหม่ แห่งนี้ เป็นเจดีย์ใหญ่ที่สูงที่สุดของอาณาจักรล้านนา สร้างขึ้นในรัชกาลพระเจ้าแสนเมืองมากษัตริย์องค์ที่ 7 แห่งราชวงศ์มังราย (พ.ศ.1913-1954) ต่อมาพระยาติโลกราชโปรดให้ช่างขยายเจดีย์ให้สูงและกว้างกว่าเดิม แล้วเสร็จเมื่อปี พ.ศ. 2024 และอัญเชิญพระแก้วมรกตมาประดิษฐาน แต่เดิมวัดเจดีย์หลวงมีชื่อว่า “โชติการามวิหาร” หมายถึง พระอารามที่มีความรุ่งเรืองสว่างไสว ทั้งยังเป็นสถานที่บรรจุพระเกศาธาตุ และพระธาตุขององค์สมเด็จพระสัมมาสัมพุทธเจ้า นอกจากนี้ “โชติการาม” ยังมีความหมายอีกนัยหนึ่ง คือ เมื่อถึงเวลาที่มีการจุดประทีบโคมไฟประดับบูชาองค์พระธาตุเจดีย์หลวง จะปรากฏแสงสีสว่างไสว มองเห็นองค์พระเจดีย์คล้ายเชิงเทียนที่มีเปลวไฟลุกโชติช่วง ดูแล้วมีความงดงามยิ่งนัก สามารถมองเห็นได้แต่ไกล        
          <br><br><img src="2.jpeg" width = "900px" class="img-fluid rounded">
          <br><br><b>3.ดอยอ่างขาง</b>
          <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ตั้งอยู่บนทิวเขาแดนลาว ตำบลแม่งอน อำเภอฝาง จังหวัดเชียงใหม่ สมเด็จพระเจ้าอยู่หัวในรัชกาลที่ 9 เสด็จฯ ทางเฮลิคอปเตอร์ ผ่านยอดดอยอ่างขาง และทอดพระเนตรลงมาเห็นกลุ่มบ้านเรือนดูคล้ายชุมชน จึงมีพระดำรัสสั่งให้เครื่องลงจอด แล้วได้ทอดพระเนตรเห็นทุ่งดอกฝิ่น และหมู่บ้านของชาวเขาเผ่ามูเซอ จึงทรงมีพระราชดำรัสที่จะเปลี่ยนทุ่งฝิ่นให้เป็นแปลงเกษตร พร้อมกับริเริ่มสร้างโครงการวิจัยผลไม้ ไม้ดอกเมืองหนาว เพื่อพัฒนาอาชีพเกษตรกรรมแก่ชาวเขาในบริเวณดอยอ่างขาง นักท่องเที่ยวสามารถเลือกซื้อผลิตผลตามฤดูกาลที่ปลูกในโครงการหลวงฯ และชมแปลงทดลองปลูกไม้ผลเมืองหนาวได้ด้วย ดอยอ่างขางมีความสูงจากระดับน้ำทะเล 1,400 เมตร และมียอดดอยสูงถึง 1,928 เมตร เป็นอีกหนึ่งที่เที่ยวเชียงใหม่ หน้าหนาวที่ไม่ควรพลาด        
          <br><br><img src="3.jpeg" width = "900px" class="img-fluid rounded">
          <br><br><b>4.สวนสัตว์เชียงใหม่</b>
          <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;เป็นสวนสัตว์ขนาดใหญ่ใครที่มาเที่ยวเชียงใหม่ต้องไม่พลาด สวนสัตว์แห่งนี้ได้รับการจัดสภาพอย่างดี บริเวณกว้างขวาง มีบรรยากาศร่มรื่น และมีสัตว์อยู่มากกว่า 2,000 ชนิด ทั้งที่มีอยู่ในเมืองไทยและนำเข้ามาจากต่างประเทศ สวนสัตว์เชียงใหม่ตั้งอยู่บริเวณทางขึ้นดอยสุเทพ เป็นอีกหนึ่งสถานที่ที่เหมาะสำหรับการพักผ่อนท่ามกลางกลิ่นอายของขุนเขา ป่าไม้ และธรรมชาติ และที่พลาดชมไปไม่ได้เลย คือ หมีแพนด้า ซึ่งเป็นทูตสันตวไมตรีจากสาธารณรัฐประชาชนจีน ผู้คนต่างให้ความสนใจเดินทางมาเยี่ยมชมเป็นจำนวนมาก        
          <br><br><img src="4.jpeg" width = "900px" class="img-fluid rounded">
          <br><br><b>5.ถนนคนเดินท่าแพ</b>  
          <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;เป็นสถานที่เที่ยวเชียงใหม่ ชอปปิ้งสุดฮิตของเมืองเชียงใหม่ เปิดทุกวันเสาร์-อาทิตย์ ภายในคูเมืองบริเวณถนนราชดำเนิน นับว่าเป็นถนนคนเดินที่ใหญ่ที่สุดในเมืองไทย ด้วยมนต์เสน่ห์ยามค่ำคืนทำให้นักท่องเที่ยวทั้งชาวไทยและชาวต่างชาติต้องไม่พลาดที่จะเดินทางมาที่นี่ มีสินค้าที่นำออกมาวางขายอย่างหลากหลายมากมาย ทั้งสินค้าพื้นเมือง สินค้า OTOP สินค้าหัตกรรมพื้นบ้าน งานแฮนด์เมด งานศิลปะ สินค้าไอเดียเก๋ อาหาร ของกินเล่น ที่ราคาเป็นกันเอง        
          <br><br><img src="5.jpeg" width = "900px" class="img-fluid rounded">
          <br><br><b>6.สถานีเกษตรหลวงอินทนนท์</b> 
          <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;เป็นโครงการอันเนื่องมาจากพระราชประสงค์ของพระบาทสมเด็จพระเจ้าอยู่หัว รัชกาลที่ 9 เพื่อส่งเสริมการปลูกพืชทดแทนการปลูกฝิ่น ที่เที่ยวเชียงใหม่ที่ถ่ายทอดวิชาความรู้ทางด้านการเกษตรแผนใหม่อันจะเพิ่มผลผลิตทางการเกษตรให้สูงขึ้น บริเวณโดยรอบพื้นที่ส่วนใหญ่เป็นหมู่บ้านที่มีราษฎรเป็นชาวไทยภูเขาเผ่ากะเหรี่ยงและเผ่าม้ง เป็นอีกหนึ่งวิธีที่จะช่วยให้ชาวบ้านได้มีอาชีพสร้างรายได้ ลดการบุกรุกพื้นที่ป่าไม้และการทำไร่เลื่อนลอย นับเป็นประโยชน์อย่างยิ่ง ปัจจุบัน ที่เที่ยวเชียงใหม่ นักท่องเที่ยวสามารถเดินทางเข้าไปเยี่ยมชมได้        
          <br><br><img src="6.jpeg" width = "900px" class="img-fluid rounded">
          <br><br><b>7.ดอยอินทนนท์</b>
          <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;เป็นยอดดอยที่สูงที่สุดของแดนสยาม 2,565 เมตร จุดสิ้นสุดของทางหลวงหมายเลข 1009 มีสภาพอากาศหนาวเย็นตลอดปี ที่เที่ยวเชียงใหม่แห่งนี้เป็นที่ตั้งสถานีเรดาร์ของกองทัพอากาศไทยและเป็นที่ประดิษฐานสถูปเจ้าอินทวิชยานนท์ เจ้าเมืองเชียงใหม่องค์สุดท้าย ดอยอินทนนท์ นับว่าเป็นส่วนหนึ่งของเทือกเขาหิมาลัย พาดผ่านจากประเทศเนปาล ภูฐาน พม่า และมาสิ้นสุดที่นี่ บรรยากาศโดยรอบอุดมไปด้วยธรรมชาติที่สมบูรณ์ ไม่ว่าจะเป็นป่าดงดิบ ป่าสน ป่าเบญจพรรณ อีกทั้งยังมีอากาศหนาวเย็นตลอดทั้งปี เชื่อได้ว่าใครที่ได้มาที่นี่จะต้องติดใจจนไม่อยากกลับ เป็นหนึ่งในที่เที่ยวเชียงใหม่ต้องห้ามพลาด        
          <br><br><img src="7.jpeg" width = "900px" class="img-fluid rounded">
          <br><br><b>8.พระตำหนักภูพิงค์ราชนิเวศน์</b>  
          <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;เป็นพระตำหนักประทับแปรพระราชฐานของพระบาทสมเด็จพระเจ้าอยู่หัวในรัชกาลที่ 9 และสมเด็จพระนางเจ้าฯ พระบรมราชินีนาถ สร้างเสร็จเมื่อปี พ.ศ. 2505 ตั้งอยู่บนดอยบวกห้า เปิดให้เป็นที่เที่ยวเชียงใหม่ สามารถเดินชมได้โดยรอบตำหนักและบริเวณซึ่งมีแปลงกุหลาบ สวนเฟิร์น และไม้นานาพรรณ พระตำหนักภูพิงคราชนิเวศน์ มีลักษณะเป็นแผนผังแบบเรือนไทยภาคกลางที่เรียกว่า “เรือนหมู่” มีรูปแบบสถาปัตยกรรมเป็นไทยประเพณีประยุกต์ ก่ออิฐถือปูน ยกพื้นสูงหลังคาทรงไทย มีความงดงามเป็นอย่างมาก เหมาะที่จะเดินทางมาพักผ่อน พร้อมกับเก็บภาพประทับใจสวยๆ คู่กับพระตำหนักและบรรยากาศโดยรอบ        
          <br><br><img src="8.jpeg" width = "900px" class="img-fluid rounded">
          <br><br><b>9.บ้านม้งดอยปุย</b>  
          <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;เป็นอีกสถาน ที่เที่ยวเชียงใหม่ หนึ่งที่เราประทับใจ เป็นหมู่บ้านชาวเขาเผ่าม้ง (แม้ว) ดอยปุย บริเวณหมู่บ้านจำหน่ายของที่ระลึก สตรอว์เบอร์รี สินค้าจำนวนมากซึ่งมีทั้งที่ผลิตภายในหมู่บ้าน และนำจากที่อื่นมาวางจำหน่ายให้แก่นักท่องเที่ยว การได้เดินทางมาที่นี่นับได้ว่าเป็นการเรียนรู้วิถีชีวิตชาวม้งอย่างแท้จริง นอกจากของที่ระลึกที่จะมีจำหน่ายให้เราได้เลือกซื้อกลับไปเป็นของที่ระลึกแล้ว เรายังจะได้แต่งกายแบบชาวม้ง โดยสามารถถ่ายรูปภายในหมู่บ้านที่มีมุมสวยๆ อยู่มากมาย ใครยังไม่เคยมา ต้องลองมาให้ได้สักครั้ง        
          <br><br><img src="9.jpeg" width = "900px" class="img-fluid rounded">
          <br><br><b>10.ถนนนิมมานเหมินทร์</b>
          <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ตั้งอยู่ตำบลสุเทพ อำเภอเมืองเชียงใหม่ เป็นถนนสั้นๆ ความยาวไม่ถึงกิโลฯ แต่ถือว่าเป็นทำเลทองของการทำธุรกิจ ที่เที่ยวเชียงใหม่ แห่งนี้เป็นแหล่งรวบรวมความทันสมัย หากจะเปรียบแล้วถนนนิมมานเหมินทร์ก็คงคล้ายกับถนนสุขุมวิทของกรุงเทพฯ นั่นเอง ถือได้ว่าเป็นถนนที่ชิคที่สุดของเชียงใหม่ โดยตลอดเส้นทางมีร้านรวงมากมายให้เราได้เดินเข้าไปสัมผัสความงดงามจากไอเดียการตกแต่งร้านที่ไม่ซ้ำกัน มีทั้งสินค้าและบริการ รวมถึงร้านอาหาร เครื่องดื่มในบรรยากาศดีๆ เป็นอีกหนึ่งสถานที่เที่ยวเชียงใหม่ที่ยังคงเอกลักษณ์ของผู้คนและศิลปะล้านนาเอาไว้ได้อย่างเต็มเปี่ยม        
          <br><br><img src="10.jpeg" width = "900px" class="img-fluid rounded">
          <br><br><b>11.แม่กำปอง</b> 
          <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ตั้งอยู่ตำบลห้วยแก้ว อำเภอแม่ออน แม่กำปองเป็นหมู่บ้านเล็กๆ ที่อยู่ท่ามกลางขุนเขา โดยที่ชาวบ้านใช้ชีวิตแบบเรียบง่าย จนกระทั่งกระแสสโลวไลฟ์บุกไปถึง แบบที่เรียกได้ว่า มาเที่ยวเชียงใหม่ไม่ได้มา แม่กำปอง เหมือนมาไม่ถึง ไฮไลท์ของแม่กำปองคงจะหนีไม่พ้นการนั่งร้านกาแฟชิวๆในอากาศเย็นๆ เพราะอากาศที่แม่กำปองเย็นสบายตลอดทั้งปี และจะมีอากาศหนาวเย็นมากในช่วงฤดูหนาว        
          <br><br><img src="11.jpeg" width = "900px" class="img-fluid rounded">
          <br><br><b>12.ม่อนแจ่ม</b>
          <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ที่เที่ยวเชียงใหม่ยอดฮิตตลอดกาล ม่อนแจ่ม ตั้งอยู่ห่างจากตัวเมืองเชียงใหม่ใช้เวลาเดินทางประมาณ 40 นาที ส่วนหนึ่งของศูนย์พัฒนาโครงการหลวงหนองหอย มีอากาศเย็นสบายตลอดทั้งปี นักท่องเที่ยวส่วนใหญ่ขึ้นไปชมวิวทิวทัศน์ ทานอาหารในซุ้ม ถ่ายรูปกับมวลหมู่ดอกไม้ เลือกซื้อผัก ผลไม้จากชาวบ้าน และสัมผัสอากาศที่หนาวเย็นบนสันเขาที่สูงจากระดับน้ำทะเล 1,350 เมตร หรือถ้าใครติดใจอยากนอนดูดาวก็สามารถจับจองที่พักม่อนแจ่ม, ม่อนอิงดาว, ม่อนวิวงาม และม่อนตะวัน        
          <br><br><img src="12.jpeg" width = "900px" class="img-fluid rounded">
          <br><br><b>13.สวนสนบ่อแก้ว</b> 
          <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ตั้งอยู่อำเภอฮอด ทางทิศใต้ของเชียงใหม่ สวนสนบ่อแก้ว เป็นส่วนหนึ่งของโครงการสำรวจวัตถุดิบ เพื่อทำเยื่อกระดาษมีเนื้อที่ประมาณ 2072 ไร่ เป็นทิวสนทอดยาวไปสุดตา ปะทะกับสายหมอกสีขาวลอยต่ำในยามที่สายหมอกไหลเข้ามาปกคลุม จนป่าสนทั้งป่ากลายเป็นสีขาว เป็นภาพที่สวยงามและโรแมนติกมาก         
          <br><br><img src="13.jpeg" width = "900px" class="img-fluid rounded">
          <br><br><b>14.ดอยม่อนอังเกตุ</b>
          <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;เป็นลานโล่ง มีความสูงถึง 1,840 เมตรสูงที่สุดในอำเภอสะเมิง จังหวัดเชียงใหม่ มีเส้นทางออฟโรดสู่ยอดดอยที่สนุกสนาน สูงชัน สมบุกสมบันและแคบมากๆ เมื่อขึ้นไปดอยม่อนอังเกตุแล้วสามารถชมได้ทั้งพระอาทิตย์ขึ้นและพระอาทิตย์ตก มีวิวทะเลหมอก 360 องศา สามารถมองวิวได้ไกลถึงยอดดอยหลวงเชียงดาว ดอยอินทนนท์ และจุดไฮไลท์คือด้านบนมีพระพุทธรูปประดิษฐานอยู่ สำหรับขาลุย ต้องไปให้ได้ซักครั้ง        
          <br><br><img src="14.jpeg" width = "900px" class="img-fluid rounded">
          <br><br><b>15.ดอยหลวงเชียงดาว</b>  
          <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;เป็นยอดเขาสูงอันดับ 3 ของประเทศ มีความสูง 2,225 เมตร ระยะทางการเดินเท้าขึ้นสู่ยอดดอยหลวงเชียงดาวถึง 6.5 กิโลเมตร - 8.5 กิโลเมตร แล้วแต่เส้นทาง ระหว่างทางมีความชัน และเหล่าดอกไม้ป่าหายากสีสันสวยงาม วิวด้านบนจุดชมวิวดอยหลวงเชียงดาว สามารถดูพระอาทิตย์ขึ้นและพระอาทิตย์ตก พร้อมมวลหมู่ดาวเต็มท้องฟ้า        
          <br><br><img src="15.jpeg" width = "900px" class="img-fluid rounded">
          <br><br><b>16.บ้านระเบียงดาว</b>
          <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;แวะโฮมสเตย์บรรยากาศชิวๆที่ บ้านระเบียงดาว อีกหนึ่งในจุดหมายปลายทางที่น่าสนใจไม่ไกลจากดอยหลวงเชียงดาว สัมผัสธรรมชาติกันได้แบบใกล้ชิด ในบรรยากาศชิลๆ ด้วยวิวภูเขาด้านหน้าที่พัก พร้อมอาหารอร่อยๆ        
          <br><br><img src="16.jpeg" width = "900px" class="img-fluid rounded">
          <br><br><b>17.บ้านข้างวัด</b> 
          <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;แหล่งช้อปปิ้งสไตล์พื้นเมือง เดินเล่นในชุมชนชิคๆ บริเวณด้านใน มีบ้านกึ่งไม้กึ่งปูนเปลือย แบบ 2 ชั้น มีร้านขนาดเล็กๆ ตั้งอยู่ติดๆกัน ตกแต่งด้วยของเก่าดั้งเดิม ที่ให้กลิ่นอายตอนที่เรายังเด็กๆ มีสินค้าหลากหลายรูปแบบ ตั้งแต่ร้านกาแฟ คาเฟ่ ขนมหวาน โปสการ์ด ของที่ระลึก ผลงานศิลปะ มีการจัดตารางเรียน workshop ให้ได้มีกิจกรรมสนุกทำ เป็นต้น ซึ่งสิ่งต่างๆเหล่านี้เป็นจุดเด่นของโครงการ "บ้านข้างวัด"       
          <br><br><img src="17.jpeg" width = "900px" class="img-fluid rounded">
          <br><br><b>18.วัดอุโมงค์</b> 
          <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;โลเคชั่นถ่ายทำละคร เรื่องรากนครา ที่ภายในดูลึกลับน่าค้นหาและแปลกตา ทำให้เป็นอีกหนึ่งที่เที่ยวเชียงใหม่ที่ไม่ควรพลาด วัดอุโมงค์ตั้งอยู่ทางทิศตะวันตกของเมืองเชียงใหม่ บริเวณเชิงดอยสุเทพ ไปตามรอยละครรากนคราได้เลยที่ วัดอุโมงค์ เชียงใหม่        
          <br><br><img src="18.jpeg" width = "900px" class="img-fluid rounded">
          <br><br><b>19.ผาช่อ</b>
          <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;นครเพตราแห่งประเทศไทย ปรากฏการณ์ตามธรรมชาติที่เกิดจากการกัดเซาะของ ลมฝนจนทำให้แผ่นดินที่เชื่อกันว่าเมื่อหลายร้อยปี หรือพันปีก่อน ถูกยกตัวเป็น เนินเขาสูงตะกอนแม่น้ำปิงก่อตัวทับถมกันเป็นชั้นๆ ผ่านกลายเวลาและถูกกัดเซาะจนกลายเป็นหน้าผาและเสาดินที่มีรูปร่าง แปลกตา จนกลายเป็นที่เที่ยวเชียงใหม่ที่ชื่อว่า ผาช่อ      
          <br><br><img src="19.jpeg" width = "900px" class="img-fluid rounded">
          <br><br><b>20.กิ่วแม่ปาน</b>
           <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;เส้นทางเดินศึกษาธรรมชาติกิ่วแม่ปาน เป็นเส้นทางเดินที่สามารถเดินได้ง่ายไม่ลำบากมากนักเหมาะแก่นักเดินป่ามือใหม่ที่ต้องการชมความงดงามของธรรมชาติอย่างเต็มที่ ทะเลหมอกขาวๆ พร้อมกับวิวภูเขาสลับซับซ้อนสุดลูกหูลูกตา เเละยังมีต้นไม้เมืองหนาวมากมาย ทั้งเฟิร์น มอส และต้นสนรวมถึงต้นกุหลาบพันปีที่เป็นไฮไลท์ของที่นี่        
          <br><br><img src="20.jpeg" width = "900px" class="img-fluid rounded">
          <br><br><b>21.ป่าสนวัดจันทร์ หรือ ศูนย์พัฒนาโครงการหลวงวัดจันทร์</b>  
          <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ที่เที่ยวเชียงใหม่ ห่างจากตัวเมืองเชียงใหม่ประมาณ 4 ชั่วโมง ป่าสนวัดจันทร์ ดินแดนในฝันที่ถูกปกคลุมด้วยสายหมอก จากพระราชดำริของพระบาทสมเด็จพระปรมินทรมหาภูมิพลอดลุยเดช ป่าสนที่ใหญ่ที่สุดในประเทศไทย บรรยากาศคล้ายกับปางอุ๋ง จังหวัดแม่ฮ่องสอน       
          <br><br><img src="21.jpeg" width = "900px" class="img-fluid rounded">
          <br><br><b>22.Canopy Walks ณ สวนพฤกษศาสตร์สมเด็จพระนางเจ้าสิริกิติ์</b>
          <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ทางเดิน Canopy Walk ที่เที่ยวเชียงใหม่แห่งใหม่ เป็นแหล่งเรียนรู้และแหล่งอนุรักษ์ธรรมชาติ มีโซนทางเดินศึกษาธรรมชาติ มีความสูงจากพื้นดินถึง 20 เมตร และมีความยาวกว่า 400 เมตร ซึ่งถือว่าเป็นทางเดินลอยฟ้าที่มีขนาดยาวที่สุดในประเทศไทยด้วย        
          <br><br><img src="22.jpeg" width = "900px" class="img-fluid rounded">
          <br><br><b>23.อุทยานแห่งชาติออบหลวง</b>
          <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ที่เที่ยวเชียงใหม่ ที่ยังไม่เป็นที่นิยมมากนัก แต่ที่นี่มีความสวยงามซุกซ่อนอยู่ อุทยานแห่งชาติออบหลวง เป็นทางเดินศึกษาธรรมชาติ โดยจุดไฮไลท์ของที่นี่ หินผาขนาดใหญ่สองฝั่งที่ดูเหมือนแตกแยกออกจากกันโดยมีสะพานเล็กๆ เชื่อมผืนดินทั้งสองฝั่งไว้       
          <br><br><img src="23.jpeg" width = "900px" class="img-fluid rounded">
          <br><br><b>24.ผาขุนแตะ ดอยผ้าขาวน้อย</b>
          <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ที่เที่ยวเชียงใหม่ เส้นทางการเดินป่าเก่าแก่ ระหว่างทางขึ้นเขาก็จะมีธรรมชาติและจุดชมวิวให้ได้แวะชมอยู่เป็นระยะ  ดอยผ้าขาวน้อย เหมาะสำหรับคนที่ชอบผจญภัย เพราะเส้นทางการเดินทางค่อนข้างลำบาก ทางแคบ ชัน และลื่นมาก แต่เมื่อขึ้นไปถึงจุดชมวิวแล้วจะพบกับวิวแบบพาโนราม่า มองไปทางไหนก็เห็นแต่ความเขียวขจี ป่าที่นี่สมบูรณ์        
          <br><br><img src="24.jpeg" width = "900px" class="img-fluid rounded">
          <br><br><b>25.ป่าปงเปียง</b>
          <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;เที่ยวนาขั้นบันไดหน้าฝน สัญญาณแห่งฤดูกาลทะเลหมอก ในบรรยากาศสุดฟิน ขลุกตัวอยู่กับธรรมชาติแบบใกล้ชิด พร้อมวิวสุดอลังการตระการตา ของนาขั้นบันไดที่สวยงามสุด ๆ อีกแห่งหนึ่งของเชียงใหม่ 
บ้านป่าบงเปียง เป็นหมู่บ้านของชาวเขาปกากะญอ มีพื้นที่ทำกินกันมาหลายรุ่น โดยปลูกทั้งข้าว ข้าวโพด และพืชผักต่าง ๆ บนเนินเขาสูง พร้อมกับชาวบ้านเปิดบ้านเป็นโฮมสเตย์ ที่พักป่าปงเปียง พร้อมอาหาร ในราคาเบาๆ        
          <br><br><img src="25.jpeg" width = "900px" class="img-fluid rounded">
          <br><br><b>26.ขุนช่างเคี่ยน</b>
          <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ชมดอกนางพญาเสือโคร่ง ซากุระเมืองไทย บริเวณขุนช่างเคี่ยนทางขึ้นผ่านดอยสุเทพ ดอกนางพญาเสือโคร่งบานเต็มพื้นที่ในช่วงเดือน ธันวาคม-มกราคม บรรยากาศราวกับอยู่ประเทศญีปุ่น มีสายหมอกปกคลุมทั่วบริเวณ        
          <br><br><img src="26.jpeg" width = "900px" class="img-fluid rounded">
        </div>
      </div>
       <div class="row">
        <div class="col-12" id="footer"> 
         <center>
            <h3>ผลงานนักเรียน</h3>
            <hr />
            <p>รายวิชา WebApplication</p>
            <p>โรงเรียนหล่มสักวิทยาคม</p>
          </center>
        </div>
      </div>
    </div>  
    <!-- Option 1: Bootstrap Bundle with Popper -->
    <script src="https://cdn.jsdelivr.net/npm/bootstrap@5.1.3/dist/js/bootstrap.bundle.min.js
" integrity="sha384-ka7Sk0Gln4gmtz2MlQnikT1wXgYsOg+OMhuP+IlRH9sENBO0LRn5q+8nbTov4+1p" crossorigin="anonymous"></script>
  </body>
</html>
